<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title></title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p><b>Tarefa Ta1 Aplicaci&#243;n multixanela Dialog<br/></b></p>
<p>Empregando xesti&#243;n multixanela Dialog desenvolve unha aplicaci&#243;n para xestionar altas <br/>de traballadores dunha empresa ficticia. A informaci&#243;n vaise gardar en memoria mediante <br/>as estruturas de datos que se consideren oportunas. Non se empregar&#225; ning&#250;n xestor de <br/>base de datos, polo cal ao pechar a aplicaci&#243;n a  informaci&#243;n perderase.<br/></p>
<p>A xanela principal para xestionar o resto da aplicaci&#243;n ser&#225; a seguinte:<br/></p>
<p>Esta xanela empr&#233;gase para xestionar o acceso ao resto das xanelas da aplicaci&#243;n. <br/>&#61607; Ao pechar esta xanela a aplicaci&#243;n finalizar&#225;.<br/>Ao premer sobre o bot&#243;n Provincias abrirase a xanela Xesti&#243;n de provincias:<br/></p>
<p>Esta xanela empr&#233;gase para xestionar as provincias. <br/>&#61607; S&#243; p&#243;dese ter aberta unha xanela deste tipo simultaneamente.<br/>&#61607; O combo Provincias cont&#233;n as provincias dadas de alta. <br/>&#61607; Ao premer sobre o bot&#243;n Engadir provincia almacenarase a provincia indicada na caixa <br/></p>
<p>de texto Nova. <br/>&#61607; Non se poden dar de alta d&#250;as provincias co mesmo nome.<br/>&#61607; Ao premer sobre o bot&#243;n Eliminar provincia eliminarase a provincia seleccionada no <br/></p>
<p>combo.<br/>&#61607; Non  se  pode  eliminar  unha  provincia  se  existe  alg&#250;n  traballador  desa  provincia <br/></p>
<p>(simulaci&#243;n de integridade referencial).<br/>&#61607; Cando demos de alta ou cando eliminemos unha provincia, en cada unha das xanelas de <br/></p>
<p>tipo Alta traballador que estean abertas d&#233;bese actualizar o combo Provincia.<br/>&#61607; D&#233;bese informar ao usuario de calquera erro que ocorra durante o emprego da xanela.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ao premer sobre o bot&#243;n Profesi&#243;ns abrirase a xanela Xesti&#243;n de profesi&#243;ns:<br/></p>
<p>Esta xanela empr&#233;gase para xestionar as profesi&#243;ns. <br/>&#61607; S&#243; p&#243;dese ter aberta unha xanela deste tipo simultaneamente.<br/>&#61607; A lista Profesi&#243;ns cont&#233;n as profesi&#243;ns dadas de alta. <br/>&#61607; Ao premer sobre o bot&#243;n Engadir profesi&#243;n almacenarase a profesi&#243;n indicada na caixa <br/></p>
<p>de texto Nova. <br/>&#61607; Non se poden dar de alta d&#250;as profesi&#243;ns co mesmo nome.<br/>&#61607; Ao premer sobre o bot&#243;n Eliminar profesi&#243;n eliminarase a profesi&#243;n seleccionada na <br/></p>
<p>lista.<br/>&#61607; Non se pode eliminar  unha profesi&#243;n se  existe  alg&#250;n traballador  con esa profesi&#243;n <br/></p>
<p>(simulaci&#243;n de integridade referencial).<br/>&#61607; Cando demos de alta ou cando eliminemos unha profesi&#243;n, en cada unha das xanelas de <br/></p>
<p>tipo Alta traballador que estean abertas d&#233;bese actualizar a lista Profesi&#243;n.<br/>&#61607; D&#233;bese informar ao usuario de calquera erro que ocorra durante o emprego da xanela.<br/>Ao premer sobre o bot&#243;n Novo traballador abrirase a xanela Alta traballador:</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Esta xanela empr&#233;gase para dar de alta a un traballador da empresa. <br/>&#61607; P&#243;dense ter abertas simultaneamente t&#243;dalas xanelas de este tipo que se consideren <br/></p>
<p>oportunas.<br/>&#61607; O combo Provincia cont&#233;n as provincias dadas de alta no sistema. <br/>&#61607; A lista Profesi&#243;n cont&#233;n t&#243;dalas profesi&#243;ns dadas de alta no sistema.<br/>&#61607; Ao premer  sobre  o  bot&#243;n Alta  darase  de  alta  un novo traballador  coa  informaci&#243;n <br/></p>
<p>indicada no formulario (t&#243;dolos campos son obrigatorios). <br/>&#61607; Non se poden dar de alta dous traballadores co mesmo DNI.<br/>&#61607; Cando  demos  de  alta  a  un  traballador,  se  est&#225;  aberta  a  xanela  de  Traballadores <br/></p>
<p>dispo&#241;ibles, d&#233;bese actualizar a s&#250;a informaci&#243;n cos datos do novo traballador dado de <br/>alta.<br/></p>
<p>&#61607; D&#233;bese informar ao usuario de calquera erro que ocorra durante o emprego da xanela.<br/>Ao  premer  sobre  o  bot&#243;n  Traballadores  dispo&#241;ibles  abrirase  a  xanela  Traballadores <br/>dispo&#241;ibles:<br/></p>
<p>Esta xanela amosa informaci&#243;n sobre os traballadores dados de alta na aplicaci&#243;n.<br/>&#61607; S&#243; p&#243;dese ter aberta unha xanela deste tipo simultaneamente.</p>

</div></div>
</body></html>